app/Models/CountryModel.php

    public function getAllCountries()
    {
        return $this->findAll();
---
SELECT *
FROM `aem_country`