app/Models/UserModel.php

SELECT *
FROM `aem_user`
WHERE `aem_phone_number` = '0349034080'
AND `aem_user_password` = '1OzWoFzX'
---
    public function validLogin($number, $password)
    {
        $builder = $this->db->table($this->table);
        $user = $builder->where('aem_phone_number', $number)
            ->where('aem_user_password', $password)
            ->get()
            ->getRowArray();